In [1]:
import pandas as pd

In [2]:
import numpy as np

### _**Pandas Library**_

Pandas---> Panel Data

Used for Data Manipulation and Analysis

Contains Pandas data structure ---> Series (1D Data) & DataFrame(2D Data)

In [ ]:
# (4,3) shaped 2D data 

data = [['name1', 20, 'place1'],
        ['name2',25,'place2'],
        ['name3',27,'place3'],
        ['name4', 29, 'place4']]

In [7]:
df = pd.DataFrame(data,columns=['name','age','place'], index = range(1,5))
df

    name  age   place
1  name1   20  place1
2  name2   25  place2
3  name3   27  place3
4  name4   29  place4

In [8]:
df.dtypes

name     object
age       int64
place    object
dtype: object

In [9]:
df.size

12

In [13]:
data1 = {'name':['name1','name2','name3'],
         'age':[22,27,28],
        'place':['a','b','c'],
        }
df1 = pd.DataFrame(data1)
df1

    name  age place
0  name1   22     a
1  name2   27     b
2  name3   28     c

In [14]:
df1.dtypes

name     object
age       int64
place    object
dtype: object

#### Dictionary of lists

In [20]:
data2 = {'name':['name1','name2','name3'],
         'age':[np.nan,27,28],
        'place':['a','b','c'],
        }
df2 = pd.DataFrame(data2)
df2

    name   age place
0  name1   NaN     a
1  name2  27.0     b
2  name3  28.0     c

#### List of  dictionary

In [18]:
data3 = [{'name': 'Ajay', 'age':27, 'place':'Kochi'},
 {'name': 'Sajin', 'age':23}]
df3 = pd.DataFrame(data3)
df3

    name  age  place
0   Ajay   27  Kochi
1  Sajin   23    NaN